{
    "Which is the serverless offering from IBM Cloud?": "Code Engine",
    "The igc sync command performs which of the following operations? Select all that apply.": ["Creates a Kubernetes namespace or openshift project if it does not exist.", "Sets up a service account in the namespace with pull secret(s) for IBM Container Registry."],
    "Pact broker is a tool used for contract testing.": "True",
    "Image signing is done in which stage of the cloud-native pipeline?": "image-release",
    "Which Probe the kubelet DO NOT perform and react on running Containers?": "Stop Probe",
    "Helm charts consists of which of the following files?": "deployment.yaml, service.yaml, .helmignore, Chart.yaml",
    "Whenever a build is done on the CI server, what are the tests it undergoes to make sure the quality of the software is high?": "All of the above",
    "Which of the following IBM Cloud services is used for application authentication?": "AppId",
    "What is IBM Cloud Shell?": "IBM Cloud Shell is a free service instantly available from your free IBM Cloud account that gives you complete control of your cloud resources, applications and infrastructure from any web-browser.",
    "Automation allows you to?": "Deliver patches faster",
    "Which of the following steps is NOT performed during application deployment on the cloud-native toolkit?": "Run the unit tests",
    "What is NOT a benefit of Modernizing your applications?": "None the above",
    "A pod can have multiple containers running inside.": "True",
    "What are the App modernization patterns?": ["Move the monolith to cloud", "Expose on-premises assets by using APIs", "Refactor the monolith into microservices", "Strangle the monolith"],
    "What is NOT a docker file?": "It is a docker image, which runs in container",
    "Which factor is NOT part of the Twelve factor design methodology?": "None of the above",
    "Tekton is the tool used for vulnerability scanning in cloud-native toolkit.": "False",
    "Which of the following stage in cloud-native toolkit pipeline include Sonar Scanning of code?": "test",
    "Which igc cli command can be used to list the endpoints, user names and passwords for the tools configured in the environment?": "igc credentials",
    "Which of the following is NOT a type of metric used by SonarQube to measure the code quality?": "Quality gate"


}